Duet3D/Duet3Expansion/src/atmel/SAM4S_DFP/1.0.56/sam4sp/atdf/ATSAM4SP32A.atdf
<?xml version="1.0" encoding="UTF-8"?>
<!-- ============================================================================ -->
<!--                  Atmel Microcontroller Software Support                      -->
<!--                       SAM Software Package License                           -->
<!-- ============================================================================ -->
<!-- Copyright (c) %copyright_year%, Atmel Corporation                                        -->
<!--                                                                              -->
<!-- All rights reserved.                                                         -->
<!--                                                                              -->
<!-- Redistribution and use in source and binary forms, with or without           -->
<!-- modification, are permitted provided that the following condition is met:    -->
<!--                                                                              -->
<!-- - Redistributions of source code must retain the above copyright notice,     -->
<!-- this list of conditions and the disclaimer below.                            -->
<!--                                                                              -->
<!-- Atmel's name may not be used to endorse or promote products derived from     -->
<!-- this software without specific prior written permission.                     -->
<!--                                                                              -->
<!-- DISCLAIMER:  THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR   -->
<!-- IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF -->
<!-- MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE   -->
<!-- DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR ANY DIRECT, INDIRECT,      -->
<!-- INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT -->
<!-- LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,  -->
<!-- OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF    -->
<!-- LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING         -->
<!-- NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, -->
<!-- EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.                           -->
<!-- ============================================================================ -->
<avr-tools-device-file xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" schema-version="0.6" xsi:noNamespaceSchemaLocation="../../schema/avr_tools_device_file.xsd">
  <variants>
    <variant ordercode="ATSAM4SP32A-AU" package="LQFP128" speedmax="120000000" tempmax="+85" tempmin="-40" vccmax="3.6" vccmin="3.0"/>
  </variants>
  <devices>
    <device architecture="CORTEX-M4" family="SAM4" name="ATSAM4SP32A" series="SAM4SP">
      <address-spaces>
        <address-space id="base" name="base" endianness="little" size="0x100000000" start="0">
          <memory-segment name="PERIPHERALS" start="0x40000000" size="0x20000000" type="io"/>
          <memory-segment name="SYSTEM" start="0xE0000000" size="0x10000000" type="io"/>
          <memory-segment name="IFLASH0" start="0x00400000" size="0x00100000" type="flash" pagesize="512"/>
          <memory-segment name="IFLASH1" start="0x00500000" size="0x00100000" type="flash" pagesize="512"/>
          <memory-segment name="IROM" start="0x00800000" size="0x00400000" type="rom"/>
          <memory-segment name="IRAM" start="0x20000000" size="0x00028000" type="ram"/>
        </address-space>
        <address-space id="fuses" name="fuses" endianness="little" size="1" start="0"/>
        <address-space id="lockbits" name="lockbits" endianness="little" size="0x20" start="0"/>
      </address-spaces>
      <peripherals>
        <module name="ACC" version="6490C">
          <instance name="ACC">
            <register-group address-space="base" name="ACC" name-in-module="ACC" offset="0x40040000"/>
          </instance>
        </module>
        <module name="ADC" version="6489L">
          <instance name="ADC">
            <register-group address-space="base" name="ADC" name-in-module="ADC" offset="0x40038000"/>
            <signals>
              <signal pad="PA8" function="B" group="ADTRG"/>
              <signal pad="PA17" function="X1" group="AD" index="0"/>
              <signal pad="PA18" function="X1" group="AD" index="1"/>
              <signal pad="PA19" function="X1" group="AD" index="2"/>
              <signal pad="PA19" function="X1" group="WKUP" index="9"/>
              <signal pad="PA20" function="X1" group="AD" index="3"/>
              <signal pad="PA20" function="X1" group="WKUP" index="10"/>
              <signal pad="PB0" function="X1" group="AD" index="4"/>
              <signal pad="PB0" function="X1" group="RTCOUT" index="0"/>
              <signal pad="PB1" function="X1" group="AD" index="5"/>
              <signal pad="PB1" function="X1" group="RTCOUT" index="1"/>
              <signal pad="PB2" function="X1" group="AD" index="6"/>
              <signal pad="PB2" function="X1" group="WKUP" index="12"/>
              <signal pad="PB3" function="X1" group="AD" index="7"/>
              <signal pad="PA21" function="X1" group="AD" index="8"/>
              <signal pad="PA22" function="X1" group="AD" index="9"/>
            </signals>
          </instance>
        </module>
        <module name="CHIPID" version="6417L">
          <instance name="CHIPID">
            <register-group address-space="base" name="CHIPID" name-in-module="CHIPID" offset="0x400E0740"/>
          </instance>
        </module>
        <module name="CMCC" version="11108B">
          <instance name="CMCC">
            <register-group address-space="base" name="CMCC" name-in-module="CMCC" offset="0x4007C000"/>
          </instance>
        </module>
        <module name="CRCCU" version="11001E">
          <instance name="CRCCU">
            <register-group address-space="base" name="CRCCU" name-in-module="CRCCU" offset="0x40044000"/>
