Duet3D/Duet3Expansion/src/atmel/SAM4S_DFP/1.0.56/sam4sp/atdf/ATSAM4SP32A.atdf
          </instance>
        </module>
        <module name="DACC" version="6461F">
          <instance name="DACC">
            <register-group address-space="base" name="DACC" name-in-module="DACC" offset="0x4003C000"/>
            <signals>
              <signal pad="PB13" function="X1" group="DAC" index="0"/>
              <signal pad="PA2" function="C" group="DATRG"/>
            </signals>
          </instance>
        </module>
        <module name="EFC" version="6450G">
          <instance name="EFC0">
            <register-group address-space="base" name="EFC0" name-in-module="EFC" offset="0x400E0A00"/>
            <parameters>
              <param name="FLASH_SIZE" value="1048576"/>
              <param name="PAGE_SIZE" value="512"/>
              <param name="PAGES_PR_REGION" value="16"/>
            </parameters>
          </instance>
          <instance name="EFC1">
            <register-group address-space="base" name="EFC1" name-in-module="EFC" offset="0x400E0C00"/>
            <parameters>
              <param name="FLASH_SIZE" value="1048576"/>
              <param name="PAGE_SIZE" value="512"/>
              <param name="PAGES_PR_REGION" value="16"/>
            </parameters>
          </instance>
        </module>
        <module name="GPBR" version="6378D">
          <instance name="GPBR">
            <register-group address-space="base" name="GPBR" name-in-module="GPBR" offset="0x400E1490"/>
          </instance>
        </module>
        <module name="MATRIX" version="6499A">
          <instance name="MATRIX">
            <register-group address-space="base" name="MATRIX" name-in-module="MATRIX" offset="0x400E0200"/>
          </instance>
        </module>
        <module name="PIO" version="11004H">
          <instance name="PIOA">
            <register-group address-space="base" name="PIOA" name-in-module="PIO" offset="0x400E0E00"/>
            <signals>
              <signal pad="PA23" function="D" group="PIODCCLK"/>
              <signal pad="PA15" function="D" group="PIODCEN" index="1"/>
              <signal pad="PA16" function="D" group="PIODCEN" index="2"/>
              <signal pad="PA24" function="D" group="PIODC" index="0"/>
              <signal pad="PA25" function="D" group="PIODC" index="1"/>
            </signals>
          </instance>
          <instance name="PIOB">
            <register-group address-space="base" name="PIOB" name-in-module="PIO" offset="0x400E1000"/>
          </instance>
          <instance name="PIOC">
            <register-group address-space="base" name="PIOC" name-in-module="PIO" offset="0x400E1200"/>
          </instance>
        </module>
        <module name="PMC" version="11116E">
          <instance name="PMC">
            <register-group address-space="base" name="PMC" name-in-module="PMC" offset="0x400E0400"/>
            <signals>
              <signal pad="PA6" function="B" group="PCK" index="0"/>
              <signal pad="PB13" function="B" group="PCK" index="0"/>
              <signal pad="PA17" function="B" group="PCK" index="1"/>
              <signal pad="PA21" function="B" group="PCK" index="1"/>
              <signal pad="PA18" function="B" group="PCK" index="2"/>
              <signal pad="PB3" function="B" group="PCK" index="2"/>
            </signals>
          </instance>
        </module>
        <module name="PPLC" version="11221B">
          <instance name="PPLC">
            <register-group address-space="base" name="PPLC" name-in-module="PPLC" offset="0x40008000"/>
            <signals>
              <signal pad="PA12" function="A" group="PMISO"/>
              <signal pad="PA13" function="A" group="PMOSI"/>
              <signal pad="PA11" function="A" group="PNPCS" index="0"/>
              <signal pad="PA14" function="A" group="PSPCK"/>
            </signals>
          </instance>
        </module>
        <module name="PWM" version="6343J">
          <instance name="PWM">
            <register-group address-space="base" name="PWM" name-in-module="PWM" offset="0x40020000"/>
            <signals>
              <signal pad="PA9" function="C" group="PWMFI" index="0"/>
              <signal pad="PA0" function="A" group="PWMH" index="0"/>
              <signal pad="PA23" function="B" group="PWMH" index="0"/>
              <signal pad="PB0" function="A" group="PWMH" index="0"/>
              <signal pad="PA1" function="A" group="PWMH" index="1"/>
              <signal pad="PA24" function="B" group="PWMH" index="1"/>
              <signal pad="PB1" function="A" group="PWMH" index="1"/>
              <signal pad="PA2" function="A" group="PWMH" index="2"/>
              <signal pad="PA25" function="B" group="PWMH" index="2"/>
              <signal pad="PB4" function="B" group="PWMH" index="2"/>
              <signal pad="PA7" function="B" group="PWMH" index="3"/>
              <signal pad="PA17" function="C" group="PWMH" index="3"/>
              <signal pad="PA19" function="B" group="PWML" index="0"/>
              <signal pad="PB5" function="B" group="PWML" index="0"/>
              <signal pad="PC0" function="B" group="PWML" index="0"/>
              <signal pad="PA20" function="B" group="PWML" index="1"/>
              <signal pad="PB12" function="A" group="PWML" index="1"/>
              <signal pad="PA16" function="C" group="PWML" index="2"/>
              <signal pad="PB13" function="A" group="PWML" index="2"/>
              <signal pad="PA15" function="C" group="PWML" index="3"/>
            </signals>
          </instance>
        </module>
        <module name="RSTC" version="11009C">
          <instance name="RSTC">
            <register-group address-space="base" name="RSTC" name-in-module="RSTC" offset="0x400E1400"/>
          </instance>
        </module>
        <module name="RTC" version="6056L">
          <instance name="RTC">
            <register-group address-space="base" name="RTC" name-in-module="RTC" offset="0x400E1460"/>
          </instance>
        </module>
        <module name="RTT" version="6081F">
          <instance name="RTT">
            <register-group address-space="base" name="RTT" name-in-module="RTT" offset="0x400E1430"/>
