Duet3D/Duet3Expansion/src/atmel/SAM4S_DFP/1.0.56/sam4sp/atdf/ATSAM4SP32A.atdf
            </instance>
        </module></peripherals>
      <interrupts>
        <interrupt index="-14" name="NonMaskableInt_IRQn" caption="Non Maskable Interrupt"/>
        <interrupt index="-12" name="MemoryManagement_IRQn" caption="Cortex-M4 Memory Management Interrupt"/>
        <interrupt index="-11" name="BusFault_IRQn" caption="Cortex-M4 Bus Fault Interrupt"/>
        <interrupt index="-10" name="UsageFault_IRQn" caption="Cortex-M4 Usage Fault Interrupt"/>
        <interrupt index="-5" name="SVCall_IRQn" caption="Cortex-M4 SV Call Interrupt"/>
        <interrupt index="-4" name="DebugMonitor_IRQn" caption="Cortex-M4 Debug Monitor Interrupt"/>
        <interrupt index="-2" name="PendSV_IRQn" caption="Cortex-M4 Pend SV Interrupt"/>
        <interrupt index="-1" name="SysTick_IRQn" caption="Cortex-M4 System Tick Interrupt"/>
        <interrupt index="0" module-instance="SYSC" name="SUPC" caption="Supply Controller"/>
        <interrupt index="1" module-instance="SYSC" name="RSTC" caption="Reset Controller"/>
        <interrupt index="2" module-instance="SYSC" name="RTC" caption="Real Time Clock"/>
        <interrupt index="3" module-instance="SYSC" name="RTT" caption="Real Time Timer"/>
        <interrupt index="4" module-instance="SYSC" name="WDT" caption="Watchdog Timer"/>
        <interrupt index="5" module-instance="PMC" name="PMC" caption="Power Management Controller"/>
        <interrupt index="6" module-instance="EFC0" name="EFC0" caption="Enhanced Embedded Flash Controller 0"/>
        <interrupt index="7" module-instance="EFC1" name="EFC1" caption="Enhanced Embedded Flash Controller 1"/>
        <interrupt index="8" module-instance="UART0" name="UART0" caption="UART 0"/>
        <interrupt index="9" module-instance="UART1" name="UART1" caption="UART 1"/>
        <interrupt index="11" module-instance="PIOA" name="PIOA" caption="Parallel I/O Controller A"/>
        <interrupt index="12" module-instance="PIOB" name="PIOB" caption="Parallel I/O Controller B"/>
        <interrupt index="13" module-instance="PIOC" name="PIOC" caption="Parallel I/O Controller C"/>
        <interrupt index="14" module-instance="USART0" name="USART0" caption="USART 0"/>
        <interrupt index="15" module-instance="USART1" name="USART1" caption="USART 1"/>
        <interrupt index="19" module-instance="TWI0" name="TWI0" caption="Two Wire Interface 0"/>
        <interrupt index="20" module-instance="TWI1" name="TWI1" caption="Two Wire Interface 1"/>
        <interrupt index="21" module-instance="PPLC" name="PPLC" caption="Proxy Power Line Communication"/>
        <interrupt index="22" module-instance="SSC" name="SSC" caption="Synchronous Serial Controller"/>
        <interrupt index="23" module-instance="TC0" name="TC0" caption="Timer/Counter 0"/>
        <interrupt index="24" module-instance="TC0" name="TC1" caption="Timer/Counter 1"/>
        <interrupt index="25" module-instance="TC0" name="TC2" caption="Timer/Counter 2"/>
        <interrupt index="26" module-instance="TC1" name="TC3" caption="Timer/Counter 3"/>
        <interrupt index="27" module-instance="TC1" name="TC4" caption="Timer/Counter 4"/>
        <interrupt index="28" module-instance="TC1" name="TC5" caption="Timer/Counter 5"/>
        <interrupt index="29" module-instance="ADC" name="ADC" caption="Analog To Digital Converter"/>
        <interrupt index="30" module-instance="DACC" name="DACC" caption="Digital To Analog Converter"/>
        <interrupt index="31" module-instance="PWM" name="PWM" caption="Pulse Width Modulation"/>
        <interrupt index="32" module-instance="CRCCU" name="CRCCU" caption="CRC Calculation Unit"/>
        <interrupt index="33" module-instance="ACC" name="ACC" caption="Analog Comparator"/>
        <interrupt index="34" module-instance="UDP" name="UDP" caption="USB Device Port"/>
      </interrupts>
      <interfaces>
        <interface type="samjtag" name="JTAG"/>
        <interface type="swd" name="SWD"/>
      </interfaces>
      <property-groups>
        <property-group name="SIGNATURES">
          <property name="JTAGID" value="0x05B3203F"/>
          <property name="CHIPID_CIDR" value="0x29A70EE8"/>
        </property-group>
      </property-groups>
      <parameters>
        <param name="__CM4_REV" value="0x0001"/>
        <param name="__MPU_PRESENT" value="1"/>
        <param name="__FPU_PRESENT" value="0"/>
        <param name="__NVIC_PRIO_BITS" value="4"/>
        <param name="__Vendor_SysTickConfig" value="0"/>
      </parameters>
    </device>
  </devices>
  <modules>
    <module caption="Analog Comparator Controller" name="ACC" version="6490C">
      <register-group name="ACC">
        <register caption="Control Register" name="ACC_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="SoftWare ReSeT" mask="0x00000001" name="SWRST"/>
        </register>
        <register caption="Mode Register" name="ACC_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="SELection for MINUS comparator input" mask="0x00000007" name="SELMINUS" values="ACC_MR__SELMINUS"/>
          <bitfield caption="SELection for PLUS comparator input" mask="0x00000070" name="SELPLUS" values="ACC_MR__SELPLUS"/>
          <bitfield caption="Analog Comparator ENable" mask="0x00000100" name="ACEN" values="ACC_MR__ACEN"/>
          <bitfield caption="EDGE TYPe" mask="0x00000600" name="EDGETYP" values="ACC_MR__EDGETYP"/>
          <bitfield caption="INVert comparator output" mask="0x00001000" name="INV" values="ACC_MR__INV"/>
          <bitfield caption="SELection of Fault Source" mask="0x00002000" name="SELFS" values="ACC_MR__SELFS"/>
          <bitfield caption="Fault Enable" mask="0x00004000" name="FE" values="ACC_MR__FE"/>
        </register>
        <register caption="Interrupt Enable Register" name="ACC_IER" offset="0x24" rw="W" size="4">
          <bitfield caption="Comparison Edge" mask="0x00000001" name="CE"/>
        </register>
        <register caption="Interrupt Disable Register" name="ACC_IDR" offset="0x28" rw="W" size="4">
          <bitfield caption="Comparison Edge" mask="0x00000001" name="CE"/>
        </register>
