Duet3D/Duet3Expansion/src/atmel/SAM4S_DFP/1.0.56/sam4sp/atdf/ATSAM4SP32A.atdf
        <register caption="Channel Data Register 5" name="ADC_CDR5" offset="0x64" rw="R" size="4">
          <bitfield caption="Converted Data" mask="0x00000FFF" name="DATA"/>
        </register>
        <register caption="Channel Data Register 6" name="ADC_CDR6" offset="0x68" rw="R" size="4">
          <bitfield caption="Converted Data" mask="0x00000FFF" name="DATA"/>
        </register>
        <register caption="Channel Data Register 7" name="ADC_CDR7" offset="0x6C" rw="R" size="4">
          <bitfield caption="Converted Data" mask="0x00000FFF" name="DATA"/>
        </register>
        <register caption="Channel Data Register 8" name="ADC_CDR8" offset="0x70" rw="R" size="4">
          <bitfield caption="Converted Data" mask="0x00000FFF" name="DATA"/>
        </register>
        <register caption="Channel Data Register 9" name="ADC_CDR9" offset="0x74" rw="R" size="4">
          <bitfield caption="Converted Data" mask="0x00000FFF" name="DATA"/>
        </register>
        <register caption="Analog Control Register" name="ADC_ACR" offset="0x94" rw="RW" size="4">
          <bitfield caption="Temperature Sensor On" mask="0x00000010" name="TSON"/>
          <bitfield caption="ADC Bias Current Control" mask="0x00000300" name="IBCTL"/>
        </register>
        <register caption="Write Protect Mode Register" name="ADC_WPMR" offset="0xE4" rw="RW" size="4">
          <bitfield caption="Write Protect Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protect KEY" mask="0xFFFFFF00" name="WPKEY"/>
        </register>
        <register caption="Write Protect Status Register" name="ADC_WPSR" offset="0xE8" rw="R" size="4">
          <bitfield caption="Write Protect Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protect Violation Source" mask="0x00FFFF00" name="WPVSRC"/>
        </register>
        <register caption="Receive Pointer Register" name="ADC_RPR" offset="0x100" rw="RW" size="4">
          <bitfield caption="Receive Pointer Register" mask="0xFFFFFFFF" name="RXPTR"/>
        </register>
        <register caption="Receive Counter Register" name="ADC_RCR" offset="0x104" rw="RW" size="4">
          <bitfield caption="Receive Counter Register" mask="0x0000FFFF" name="RXCTR"/>
        </register>
        <register caption="Receive Next Pointer Register" name="ADC_RNPR" offset="0x110" rw="RW" size="4">
          <bitfield caption="Receive Next Pointer" mask="0xFFFFFFFF" name="RXNPTR"/>
        </register>
        <register caption="Receive Next Counter Register" name="ADC_RNCR" offset="0x114" rw="RW" size="4">
          <bitfield caption="Receive Next Counter" mask="0x0000FFFF" name="RXNCTR"/>
        </register>
        <register caption="Transfer Control Register" name="ADC_PTCR" offset="0x120" rw="W" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Receiver Transfer Disable" mask="0x00000002" name="RXTDIS"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
          <bitfield caption="Transmitter Transfer Disable" mask="0x00000200" name="TXTDIS"/>
        </register>
        <register caption="Transfer Status Register" name="ADC_PTSR" offset="0x124" rw="R" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
        </register>
      </register-group>
      <value-group caption="" name="ADC_MR__TRGEN">
        <value caption="Hardware triggers are disabled. Starting a conversion is only possible by software." name="DIS" value="0"/>
        <value caption="Hardware trigger selected by TRGSEL field is enabled." name="EN" value="1"/>
      </value-group>
      <value-group caption="" name="ADC_MR__TRGSEL">
        <value caption="External trigger" name="ADC_TRIG0" value="0x0"/>
        <value caption="TIO Output of the Timer Counter Channel 0" name="ADC_TRIG1" value="0x1"/>
        <value caption="TIO Output of the Timer Counter Channel 1" name="ADC_TRIG2" value="0x2"/>
        <value caption="TIO Output of the Timer Counter Channel 2" name="ADC_TRIG3" value="0x3"/>
        <value caption="PWM Event Line 0" name="ADC_TRIG4" value="0x4"/>
        <value caption="PWM Event Line 1" name="ADC_TRIG5" value="0x5"/>
      </value-group>
      <value-group caption="" name="ADC_MR__LOWRES">
        <value caption="12-bit resolution" name="BITS_12" value="0"/>
        <value caption="10-bit resolution" name="BITS_10" value="1"/>
      </value-group>
      <value-group caption="" name="ADC_MR__SLEEP">
        <value caption="Normal Mode: The ADC Core and reference voltage circuitry are kept ON between conversions" name="NORMAL" value="0"/>
        <value caption="Sleep Mode: The wake-up time can be modified by programming FWUP bit" name="SLEEP" value="1"/>
      </value-group>
      <value-group caption="" name="ADC_MR__FWUP">
        <value caption="If SLEEP is 1 then both ADC Core and reference voltage circuitry are OFF between conversions" name="OFF" value="0"/>
        <value caption="If SLEEP is 1 then Fast Wake-up Sleep Mode: The Voltage reference is ON between conversions and ADC Core is OFF" name="ON" value="1"/>
      </value-group>
      <value-group caption="" name="ADC_MR__FREERUN">
        <value caption="Normal Mode" name="OFF" value="0"/>
        <value caption="Free Run Mode: Never wait for any trigger." name="ON" value="1"/>
      </value-group>
      <value-group caption="" name="ADC_MR__STARTUP">
        <value caption="0 periods of ADCClock" name="SUT0" value="0x0"/>
        <value caption="8 periods of ADCClock" name="SUT8" value="0x1"/>
        <value caption="16 periods of ADCClock" name="SUT16" value="0x2"/>
        <value caption="24 periods of ADCClock" name="SUT24" value="0x3"/>
        <value caption="64 periods of ADCClock" name="SUT64" value="0x4"/>
        <value caption="80 periods of ADCClock" name="SUT80" value="0x5"/>
        <value caption="96 periods of ADCClock" name="SUT96" value="0x6"/>
        <value caption="112 periods of ADCClock" name="SUT112" value="0x7"/>
        <value caption="512 periods of ADCClock" name="SUT512" value="0x8"/>
        <value caption="576 periods of ADCClock" name="SUT576" value="0x9"/>
        <value caption="640 periods of ADCClock" name="SUT640" value="0xA"/>
        <value caption="704 periods of ADCClock" name="SUT704" value="0xB"/>
        <value caption="768 periods of ADCClock" name="SUT768" value="0xC"/>
        <value caption="832 periods of ADCClock" name="SUT832" value="0xD"/>
        <value caption="896 periods of ADCClock" name="SUT896" value="0xE"/>
        <value caption="960 periods of ADCClock" name="SUT960" value="0xF"/>
      </value-group>
      <value-group caption="" name="ADC_MR__SETTLING">
        <value caption="3 periods of ADCClock" name="AST3" value="0x0"/>
        <value caption="5 periods of ADCClock" name="AST5" value="0x1"/>
        <value caption="9 periods of ADCClock" name="AST9" value="0x2"/>
        <value caption="17 periods of ADCClock" name="AST17" value="0x3"/>
      </value-group>
