Duet3D/Duet3Expansion/src/atmel/SAM4S_DFP/1.0.56/sam4sp/atdf/ATSAM4SP32A.atdf
        <register caption="Endpoint Control and Status Register 6" name="UDP_CSR6" offset="0x48" rw="RW" size="4">
          <bitfield caption="Generates an IN Packet with Data Previously Written in the DPR" mask="0x00000001" name="TXCOMP"/>
          <bitfield caption="Receive Data Bank 0" mask="0x00000002" name="RX_DATA_BK0"/>
          <bitfield caption="Received Setup" mask="0x00000004" name="RXSETUP"/>
          <bitfield caption="Stall Sent" mask="0x00000008" name="STALLSENT"/>
          <bitfield caption="Transmit Packet Ready" mask="0x00000010" name="TXPKTRDY"/>
          <bitfield caption="Force Stall (used by Control, Bulk and Isochronous Endpoints)" mask="0x00000020" name="FORCESTALL"/>
          <bitfield caption="Receive Data Bank 1 (only used by endpoints with ping-pong attributes)" mask="0x00000040" name="RX_DATA_BK1"/>
          <bitfield caption="Transfer Direction (only available for control endpoints)" mask="0x00000080" name="DIR"/>
          <bitfield caption="Endpoint Type" mask="0x00000700" name="EPTYPE" values="UDP_CSR__EPTYPE"/>
          <bitfield caption="Data Toggle" mask="0x00000800" name="DTGLE"/>
          <bitfield caption="Endpoint Enable Disable" mask="0x00008000" name="EPEDS"/>
          <bitfield caption="Number of Bytes Available in the FIFO" mask="0x07FF0000" name="RXBYTECNT"/>
        </register>
        <register caption="Endpoint Control and Status Register 7" name="UDP_CSR7" offset="0x4C" rw="RW" size="4">
          <bitfield caption="Generates an IN Packet with Data Previously Written in the DPR" mask="0x00000001" name="TXCOMP"/>
          <bitfield caption="Receive Data Bank 0" mask="0x00000002" name="RX_DATA_BK0"/>
          <bitfield caption="Received Setup" mask="0x00000004" name="RXSETUP"/>
          <bitfield caption="Stall Sent" mask="0x00000008" name="STALLSENT"/>
          <bitfield caption="Transmit Packet Ready" mask="0x00000010" name="TXPKTRDY"/>
          <bitfield caption="Force Stall (used by Control, Bulk and Isochronous Endpoints)" mask="0x00000020" name="FORCESTALL"/>
          <bitfield caption="Receive Data Bank 1 (only used by endpoints with ping-pong attributes)" mask="0x00000040" name="RX_DATA_BK1"/>
          <bitfield caption="Transfer Direction (only available for control endpoints)" mask="0x00000080" name="DIR"/>
          <bitfield caption="Endpoint Type" mask="0x00000700" name="EPTYPE" values="UDP_CSR__EPTYPE"/>
          <bitfield caption="Data Toggle" mask="0x00000800" name="DTGLE"/>
          <bitfield caption="Endpoint Enable Disable" mask="0x00008000" name="EPEDS"/>
          <bitfield caption="Number of Bytes Available in the FIFO" mask="0x07FF0000" name="RXBYTECNT"/>
        </register>
        <register caption="Endpoint FIFO Data Register 0" name="UDP_FDR0" offset="0x50" rw="RW" size="4">
          <bitfield caption="FIFO Data Value" mask="0x000000FF" name="FIFO_DATA"/>
        </register>
        <register caption="Endpoint FIFO Data Register 1" name="UDP_FDR1" offset="0x54" rw="RW" size="4">
          <bitfield caption="FIFO Data Value" mask="0x000000FF" name="FIFO_DATA"/>
        </register>
        <register caption="Endpoint FIFO Data Register 2" name="UDP_FDR2" offset="0x58" rw="RW" size="4">
          <bitfield caption="FIFO Data Value" mask="0x000000FF" name="FIFO_DATA"/>
        </register>
        <register caption="Endpoint FIFO Data Register 3" name="UDP_FDR3" offset="0x5C" rw="RW" size="4">
          <bitfield caption="FIFO Data Value" mask="0x000000FF" name="FIFO_DATA"/>
        </register>
        <register caption="Endpoint FIFO Data Register 4" name="UDP_FDR4" offset="0x60" rw="RW" size="4">
          <bitfield caption="FIFO Data Value" mask="0x000000FF" name="FIFO_DATA"/>
        </register>
        <register caption="Endpoint FIFO Data Register 5" name="UDP_FDR5" offset="0x64" rw="RW" size="4">
          <bitfield caption="FIFO Data Value" mask="0x000000FF" name="FIFO_DATA"/>
        </register>
        <register caption="Endpoint FIFO Data Register 6" name="UDP_FDR6" offset="0x68" rw="RW" size="4">
          <bitfield caption="FIFO Data Value" mask="0x000000FF" name="FIFO_DATA"/>
        </register>
        <register caption="Endpoint FIFO Data Register 7" name="UDP_FDR7" offset="0x6C" rw="RW" size="4">
          <bitfield caption="FIFO Data Value" mask="0x000000FF" name="FIFO_DATA"/>
        </register>
        <register caption="Transceiver Control Register" name="UDP_TXVC" offset="0x074" rw="RW" size="4">
          <bitfield caption="Transceiver Disable" mask="0x00000100" name="TXVDIS"/>
          <bitfield caption="Pull-up On" mask="0x00000200" name="PUON"/>
        </register>
      </register-group>
      <value-group caption="" name="UDP_CSR__EPTYPE">
        <value caption="Control" name="CTRL" value="0x0"/>
        <value caption="Isochronous OUT" name="ISO_OUT" value="0x1"/>
        <value caption="Bulk OUT" name="BULK_OUT" value="0x2"/>
        <value caption="Interrupt OUT" name="INT_OUT" value="0x3"/>
        <value caption="Isochronous IN" name="ISO_IN" value="0x5"/>
        <value caption="Bulk IN" name="BULK_IN" value="0x6"/>
        <value caption="Interrupt IN" name="INT_IN" value="0x7"/>
      </value-group>
      <value-group caption="" name="UDP_CSR__EPTYPE">
        <value caption="Control" name="CTRL" value="0x0"/>
        <value caption="Isochronous OUT" name="ISO_OUT" value="0x1"/>
        <value caption="Bulk OUT" name="BULK_OUT" value="0x2"/>
        <value caption="Interrupt OUT" name="INT_OUT" value="0x3"/>
        <value caption="Isochronous IN" name="ISO_IN" value="0x5"/>
        <value caption="Bulk IN" name="BULK_IN" value="0x6"/>
        <value caption="Interrupt IN" name="INT_IN" value="0x7"/>
      </value-group>
      <value-group caption="" name="UDP_CSR__EPTYPE">
        <value caption="Control" name="CTRL" value="0x0"/>
        <value caption="Isochronous OUT" name="ISO_OUT" value="0x1"/>
        <value caption="Bulk OUT" name="BULK_OUT" value="0x2"/>
        <value caption="Interrupt OUT" name="INT_OUT" value="0x3"/>
        <value caption="Isochronous IN" name="ISO_IN" value="0x5"/>
        <value caption="Bulk IN" name="BULK_IN" value="0x6"/>
        <value caption="Interrupt IN" name="INT_IN" value="0x7"/>
      </value-group>
      <value-group caption="" name="UDP_CSR__EPTYPE">
        <value caption="Control" name="CTRL" value="0x0"/>
        <value caption="Isochronous OUT" name="ISO_OUT" value="0x1"/>
        <value caption="Bulk OUT" name="BULK_OUT" value="0x2"/>
        <value caption="Interrupt OUT" name="INT_OUT" value="0x3"/>
        <value caption="Isochronous IN" name="ISO_IN" value="0x5"/>
        <value caption="Bulk IN" name="BULK_IN" value="0x6"/>
        <value caption="Interrupt IN" name="INT_IN" value="0x7"/>
      </value-group>
      <value-group caption="" name="UDP_CSR__EPTYPE">
        <value caption="Control" name="CTRL" value="0x0"/>
        <value caption="Isochronous OUT" name="ISO_OUT" value="0x1"/>
        <value caption="Bulk OUT" name="BULK_OUT" value="0x2"/>
        <value caption="Interrupt OUT" name="INT_OUT" value="0x3"/>
        <value caption="Isochronous IN" name="ISO_IN" value="0x5"/>
        <value caption="Bulk IN" name="BULK_IN" value="0x6"/>
        <value caption="Interrupt IN" name="INT_IN" value="0x7"/>
      </value-group>
      <value-group caption="" name="UDP_CSR__EPTYPE">
        <value caption="Control" name="CTRL" value="0x0"/>
        <value caption="Isochronous OUT" name="ISO_OUT" value="0x1"/>
        <value caption="Bulk OUT" name="BULK_OUT" value="0x2"/>
        <value caption="Interrupt OUT" name="INT_OUT" value="0x3"/>
        <value caption="Isochronous IN" name="ISO_IN" value="0x5"/>
        <value caption="Bulk IN" name="BULK_IN" value="0x6"/>
        <value caption="Interrupt IN" name="INT_IN" value="0x7"/>
      </value-group>
      <value-group caption="" name="UDP_CSR__EPTYPE">
        <value caption="Control" name="CTRL" value="0x0"/>
        <value caption="Isochronous OUT" name="ISO_OUT" value="0x1"/>
        <value caption="Bulk OUT" name="BULK_OUT" value="0x2"/>
        <value caption="Interrupt OUT" name="INT_OUT" value="0x3"/>
        <value caption="Isochronous IN" name="ISO_IN" value="0x5"/>
        <value caption="Bulk IN" name="BULK_IN" value="0x6"/>
        <value caption="Interrupt IN" name="INT_IN" value="0x7"/>
      </value-group>
      <value-group caption="" name="UDP_CSR__EPTYPE">
        <value caption="Control" name="CTRL" value="0x0"/>
        <value caption="Isochronous OUT" name="ISO_OUT" value="0x1"/>
        <value caption="Bulk OUT" name="BULK_OUT" value="0x2"/>
        <value caption="Interrupt OUT" name="INT_OUT" value="0x3"/>
        <value caption="Isochronous IN" name="ISO_IN" value="0x5"/>
        <value caption="Bulk IN" name="BULK_IN" value="0x6"/>
        <value caption="Interrupt IN" name="INT_IN" value="0x7"/>
      </value-group>
    </module>
    <module caption="Universal Synchronous Asynchronous Receiver Transmitter" name="USART" version="6089Z">
      <register-group name="USART">
        <register caption="Control Register" name="US_CR" offset="0x0000" rw="W" size="4">
          <bitfield caption="Reset Receiver" mask="0x00000004" name="RSTRX"/>
          <bitfield caption="Reset Transmitter" mask="0x00000008" name="RSTTX"/>
          <bitfield caption="Receiver Enable" mask="0x00000010" name="RXEN"/>
          <bitfield caption="Receiver Disable" mask="0x00000020" name="RXDIS"/>
          <bitfield caption="Transmitter Enable" mask="0x00000040" name="TXEN"/>
          <bitfield caption="Transmitter Disable" mask="0x00000080" name="TXDIS"/>
          <bitfield caption="Reset Status Bits" mask="0x00000100" name="RSTSTA"/>
          <bitfield caption="Start Break" mask="0x00000200" name="STTBRK"/>
          <bitfield caption="Stop Break" mask="0x00000400" name="STPBRK"/>
          <bitfield caption="Start Time-out" mask="0x00000800" name="STTTO"/>
          <bitfield caption="Send Address" mask="0x00001000" name="SENDA"/>
          <bitfield caption="Reset Iterations" mask="0x00002000" name="RSTIT"/>
          <bitfield caption="Reset Non Acknowledge" mask="0x00004000" name="RSTNACK"/>
          <bitfield caption="Rearm Time-out" mask="0x00008000" name="RETTO"/>
          <bitfield caption="Request to Send Enable" mask="0x00040000" name="RTSEN"/>
          <bitfield caption="Request to Send Disable" mask="0x00080000" name="RTSDIS"/>
        </register>
        <register caption="Mode Register" name="US_MR" offset="0x0004" rw="RW" size="4">
          <bitfield caption="USART Mode of Operation" mask="0x0000000F" name="USART_MODE" values="US_MR__USART_MODE"/>
          <bitfield caption="Clock Selection" mask="0x00000030" name="USCLKS" values="US_MR__USCLKS"/>
          <bitfield caption="Character Length." mask="0x000000C0" name="CHRL" values="US_MR__CHRL"/>
          <bitfield caption="Synchronous Mode Select" mask="0x00000100" name="SYNC"/>
          <bitfield caption="Parity Type" mask="0x00000E00" name="PAR" values="US_MR__PAR"/>
          <bitfield caption="Number of Stop Bits" mask="0x00003000" name="NBSTOP" values="US_MR__NBSTOP"/>
          <bitfield caption="Channel Mode" mask="0x0000C000" name="CHMODE" values="US_MR__CHMODE"/>
          <bitfield caption="Bit Order" mask="0x00010000" name="MSBF"/>
          <bitfield caption="9-bit Character Length" mask="0x00020000" name="MODE9"/>
          <bitfield caption="Clock Output Select" mask="0x00040000" name="CLKO"/>
          <bitfield caption="Oversampling Mode" mask="0x00080000" name="OVER"/>
          <bitfield caption="Inhibit Non Acknowledge" mask="0x00100000" name="INACK"/>
          <bitfield caption="Disable Successive NACK" mask="0x00200000" name="DSNACK"/>
          <bitfield caption="Variable Synchronization of Command/Data Sync Start Frame Delimiter" mask="0x00400000" name="VAR_SYNC"/>
          <bitfield caption="Inverted Data" mask="0x00800000" name="INVDATA"/>
          <bitfield caption="Maximum Number of Automatic Iteration" mask="0x07000000" name="MAX_ITERATION"/>
          <bitfield caption="Infrared Receive Line Filter" mask="0x10000000" name="FILTER"/>
          <bitfield caption="Manchester Encoder/Decoder Enable" mask="0x20000000" name="MAN"/>
          <bitfield caption="Manchester Synchronization Mode" mask="0x40000000" name="MODSYNC"/>
          <bitfield caption="Start Frame Delimiter Selector" mask="0x80000000" name="ONEBIT"/>
        </register>
        <register caption="Interrupt Enable Register" name="US_IER" offset="0x0008" rw="W" size="4">
          <bitfield caption="RXRDY Interrupt Enable" mask="0x00000001" name="RXRDY"/>
          <bitfield caption="TXRDY Interrupt Enable" mask="0x00000002" name="TXRDY"/>
          <bitfield caption="Receiver Break Interrupt Enable" mask="0x00000004" name="RXBRK"/>
          <bitfield caption="End of Receive Transfer Interrupt Enable (available in all USART modes of operation)" mask="0x00000008" name="ENDRX"/>
          <bitfield caption="End of Transmit Interrupt Enable (available in all USART modes of operation)" mask="0x00000010" name="ENDTX"/>
          <bitfield caption="Overrun Error Interrupt Enable" mask="0x00000020" name="OVRE"/>
          <bitfield caption="Framing Error Interrupt Enable" mask="0x00000040" name="FRAME"/>
          <bitfield caption="Parity Error Interrupt Enable" mask="0x00000080" name="PARE"/>
          <bitfield caption="Time-out Interrupt Enable" mask="0x00000100" name="TIMEOUT"/>
          <bitfield caption="TXEMPTY Interrupt Enable" mask="0x00000200" name="TXEMPTY"/>
          <bitfield caption="Max number of Repetitions Reached Interrupt Enable" mask="0x00000400" name="ITER"/>
          <bitfield caption="Buffer Empty Interrupt Enable (available in all USART modes of operation)" mask="0x00000800" name="TXBUFE"/>
          <bitfield caption="Buffer Full Interrupt Enable (available in all USART modes of operation)" mask="0x00001000" name="RXBUFF"/>
          <bitfield caption="Non AcknowledgeInterrupt Enable" mask="0x00002000" name="NACK"/>
          <bitfield caption="Clear to Send Input Change Interrupt Enable" mask="0x00080000" name="CTSIC"/>
          <bitfield caption="Manchester Error Interrupt Enable" mask="0x01000000" name="MANE"/>
        </register>
        <register caption="Interrupt Disable Register" name="US_IDR" offset="0x000C" rw="W" size="4">
          <bitfield caption="RXRDY Interrupt Disable" mask="0x00000001" name="RXRDY"/>
          <bitfield caption="TXRDY Interrupt Disable" mask="0x00000002" name="TXRDY"/>
          <bitfield caption="Receiver Break Interrupt Disable" mask="0x00000004" name="RXBRK"/>
          <bitfield caption="End of Receive Transfer Interrupt Disable (available in all USART modes of operation)" mask="0x00000008" name="ENDRX"/>
          <bitfield caption="End of Transmit Interrupt Disable (available in all USART modes of operation)" mask="0x00000010" name="ENDTX"/>
          <bitfield caption="Overrun Error Interrupt Enable" mask="0x00000020" name="OVRE"/>
          <bitfield caption="Framing Error Interrupt Disable" mask="0x00000040" name="FRAME"/>
          <bitfield caption="Parity Error Interrupt Disable" mask="0x00000080" name="PARE"/>
          <bitfield caption="Time-out Interrupt Disable" mask="0x00000100" name="TIMEOUT"/>
          <bitfield caption="TXEMPTY Interrupt Disable" mask="0x00000200" name="TXEMPTY"/>
          <bitfield caption="Max Number of Repetitions Reached Interrupt Disable" mask="0x00000400" name="ITER"/>
          <bitfield caption="Buffer Empty Interrupt Disable (available in all USART modes of operation)" mask="0x00000800" name="TXBUFE"/>
          <bitfield caption="Buffer Full Interrupt Disable (available in all USART modes of operation)" mask="0x00001000" name="RXBUFF"/>
          <bitfield caption="Non AcknowledgeInterrupt Disable" mask="0x00002000" name="NACK"/>
          <bitfield caption="Clear to Send Input Change Interrupt Disable" mask="0x00080000" name="CTSIC"/>
          <bitfield caption="Manchester Error Interrupt Disable" mask="0x01000000" name="MANE"/>
        </register>
